* 听力

** 1

*** 1

**** transcript

这不是一所普通小学，它是中华人民共和国成立后北京出现的第一所私立小学——京华私立学校。家长在给孩子办理报名手续的同时，还要交3万元的入学赞助费。这一切令当时的北京人目瞪口呆。

***** ANSWERED Are "--" the correct part for that part of the text?
:PROPERTIES:
:CREATED: [2022-08-22 09:04:30 -05]
:END:
:LOGBOOK:
- State "ANSWERED"   from "QUESTION"   [2022-08-24 Wed 00:48]
- State "QUESTION"   from              [2022-08-22 Mon 09:04]
:END:

No, the correct characters are =——= as used in the transcription of the audios in pandarin.net (e.g. https://pandarin.net/belajar/hsk6-chapter16/). The  following was retrieved from that website.

#+begin_quote
1. 这不是一所普通小学，它是中华人民共和国成立后北京出现的第一所私立小 学——京华私立学校。家长在给孩子办理报名手续的同时，还要交3万元的入学 赞助费。这一切令当时的北京人目瞪口呆。
#+end_quote

Note that if we grep the directory of our rime configuration, those characters are shown.

#+begin_src dash
grep -R '—' ~/.config/ibus/rime
#+end_src

#+RESULTS:
#+begin_example
/home/beep1560/.config/ibus/rime/array30_wsymbols.dict.yaml:—	w1
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/default.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/default.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    _: "——"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    _: "——"
#+end_example

If we search for the regular dash characters, we get more lines because that character is used in more contexts (e.g. to start the key, value pair in a YAML file). The other character is used less, but is still present because that might be the character that should be used along with Chinese characters.

#+begin_src dash
grep -R '-' ~/.config/ibus/rime
#+end_src

#+RESULTS:
#+begin_example
/home/beep1560/.config/ibus/rime/array30_query.userdb/CURRENT:MANIFEST-000190
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG.old:2022/08/24-00:45:25.779551 140641316208448 Recovering log #186
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG.old:2022/08/24-00:45:25.779579 140641316208448 Level-0 table #188: started
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG.old:2022/08/24-00:45:25.779591 140641316208448 Level-0 table #188: 0 bytes OK
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG.old:2022/08/24-00:45:25.896163 140641316208448 Delete type=3 #184
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG.old:2022/08/24-00:45:25.896191 140641316208448 Delete type=0 #186
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG:2022/08/24-00:45:50.909160 140641316208448 Recovering log #189
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG:2022/08/24-00:45:50.909184 140641316208448 Level-0 table #191: started
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG:2022/08/24-00:45:50.909196 140641316208448 Level-0 table #191: 0 bytes OK
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG:2022/08/24-00:45:51.092853 140641316208448 Delete type=3 #187
/home/beep1560/.config/ibus/rime/array30_query.userdb/LOG:2022/08/24-00:45:51.092867 140641316208448 Delete type=0 #189
/home/beep1560/.config/ibus/rime/array30.dict.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30.dict.yaml:---
/home/beep1560/.config/ibus/rime/array30.dict.yaml:  - array30_main
/home/beep1560/.config/ibus/rime/array30.dict.yaml:  - array30_phrases    # 使用本方案附帶之行列詞庫，如使用八股文詞敬請將此行註解／移除
/home/beep1560/.config/ibus/rime/array30.dict.yaml:  - array30_emoji
/home/beep1560/.config/ibus/rime/array30.dict.yaml:#    - '^.*!$'
/home/beep1560/.config/ibus/rime/array30.dict.yaml:#    - '^.*@$'
/home/beep1560/.config/ibus/rime/array30.dict.yaml:#    - length_equal: 2
/home/beep1560/.config/ibus/rime/array30.dict.yaml:#    - length_equal: 3
/home/beep1560/.config/ibus/rime/array30.dict.yaml:#    - length_in_range: [3, 99]
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:# 行列30 - Emoji鍵碼表
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - Unicode Emoji 13.1
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - Terry Tsang <archerindigo@gmail.com>
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - Emoji按分類編成兩碼或三碼
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - 首碼為第一層分類，按官方類別順序編到大階A-L行
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - 第二碼為第二層分類，按官方類別順序，編到大階A-Z字母順序
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - 第三碼為膚色碼（現時只有在People & Body一類才會出現）
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#     - 沒有膚色碼則為原生膚色
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#     - 膚色碼從淺到深順序編到大階A-G行
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#     - 如emoji涉及多於一種膚色（如family類emoji），則只編首膚色碼（不排除日後增加第二膚色碼）
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - 一般情況不為emoji編單碼按鍵，讓rime逐鍵提示功能在用家輸入emoji第一碼後順序列出及提示用戶第二及第三分類的按鍵，讓用家更易了解各類emoji的精準鍵碼
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - 旗幟類特別機制：按旗幟本身兩碼簡稱作第二、三碼（例如香港旗取碼為LHK、台灣為LTW）。非國家旗幟因數量甚少，全部編到單碼L
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:#   - #️⃣	因yaml語法問題無法編碼
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:---
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-smiling 13
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-affection 9
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-tongue 6
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-hand 4
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-neutral-skeptical 12
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-sleepy 5
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-unwell 12
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-hat 3
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-glasses 3
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-concerned 24
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-negative 8
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## face-costume 8
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## cat-face 9
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## monkey-face 3
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## hand-fingers-open 5
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## hand-fingers-partial 8
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## hand-single-finger 6
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## hand-fingers-closed 6
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## hand-prop 3
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## body-parts 17
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## person-gesture 30
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## person-role 79
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## person-fantasy 31
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## person-activity 39
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## person-sport 43
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## person-resting 5
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## person-symbol 5
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### hand-fingers-open 25
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### hand-fingers-partial 40
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### hand-single-finger 30
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### hand-fingers-closed 30
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### hand-prop 15
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### body-parts 30
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### person-gesture 150
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### person-role 395
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### person-fantasy 125
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### person-activity 180
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:### person-sport 215
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## animal-mammal 64
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## animal-bird 18
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## animal-amphibian 1
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## animal-reptile 8
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## animal-marine 10
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## animal-bug 16
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## plant-flower 10
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## plant-other 13
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## food-fruit 19
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## food-vegetable 15
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## food-prepared 34
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## food-asian 17
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## food-marine 5
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## food-sweet 14
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## place-map 7
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## place-geographic 9
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## place-building 27
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## place-religious 6
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## place-other 16
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## transport-ground 49
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## transport-water 8
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## transport-air 13
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## award-medal 
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## musical-instrument 9
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## book-paper 17
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## other-object 6
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## transport-sign 13
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## av-symbol 24
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## other-symbol 21
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## country-flag 258
/home/beep1560/.config/ibus/rime/array30_emoji.dict.yaml:## subdivision-flag 3
/home/beep1560/.config/ibus/rime/array30.userdb/CURRENT:MANIFEST-000204
/home/beep1560/.config/ibus/rime/array30.userdb/LOG.old:2022/08/24-00:45:25.665790 140641316208448 Recovering log #200
/home/beep1560/.config/ibus/rime/array30.userdb/LOG.old:2022/08/24-00:45:25.665817 140641316208448 Level-0 table #202: started
/home/beep1560/.config/ibus/rime/array30.userdb/LOG.old:2022/08/24-00:45:25.695105 140641316208448 Level-0 table #202: 202 bytes OK
/home/beep1560/.config/ibus/rime/array30.userdb/LOG.old:2022/08/24-00:45:25.778766 140641316208448 Delete type=3 #198
/home/beep1560/.config/ibus/rime/array30.userdb/LOG.old:2022/08/24-00:45:25.778797 140641316208448 Delete type=0 #200
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.760405 140641316208448 Recovering log #203
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.760434 140641316208448 Level-0 table #205: started
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.807839 140641316208448 Level-0 table #205: 173 bytes OK
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.908209 140641316208448 Delete type=3 #201
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.908233 140641316208448 Delete type=0 #203
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.908315 140641080170176 Compacting 4@0 + 1@1 files
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.958952 140641080170176 Generated table #207@0: 66 keys, 1476 bytes
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:50.958984 140641080170176 Compacted 4@0 + 1@1 files => 1476 bytes
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:51.039127 140641080170176 compacted to: files[ 0 1 0 0 0 0 0 ]
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:51.039234 140641080170176 Delete type=2 #205
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:51.039250 140641080170176 Delete type=2 #199
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:51.039261 140641080170176 Delete type=2 #202
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:51.039270 140641080170176 Delete type=2 #196
/home/beep1560/.config/ibus/rime/array30.userdb/LOG:2022/08/24-00:45:51.039279 140641080170176 Delete type=2 #194
/home/beep1560/.config/ibus/rime/default.custom.yaml:    - schema: pinyin_simp
/home/beep1560/.config/ibus/rime/default.custom.yaml:    - schema: array30
/home/beep1560/.config/ibus/rime/pinyin_simp.dict.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/pinyin_simp.dict.yaml:---
/home/beep1560/.config/ibus/rime/array30_wsymbols.dict.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30_wsymbols.dict.yaml:# 行列30 - w+數字 符號組鍵碼表
/home/beep1560/.config/ibus/rime/array30_wsymbols.dict.yaml:#   - w+數字 符號組
/home/beep1560/.config/ibus/rime/array30_wsymbols.dict.yaml:#   - Terry Tsang <archerindigo@gmail.com>
/home/beep1560/.config/ibus/rime/array30_wsymbols.dict.yaml:---
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/CURRENT:MANIFEST-000007
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG.old:2022/08/23-22:19:18.677495 140641316208448 Recovering log #3
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG.old:2022/08/23-22:19:18.677532 140641316208448 Level-0 table #5: started
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG.old:2022/08/23-22:19:18.705743 140641316208448 Level-0 table #5: 299 bytes OK
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG.old:2022/08/23-22:19:18.791556 140641316208448 Delete type=0 #3
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG.old:2022/08/23-22:19:18.791586 140641316208448 Delete type=3 #2
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG:2022/08/24-00:44:20.769815 140641316208448 Recovering log #6
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG:2022/08/24-00:44:20.836692 140641316208448 Delete type=0 #6
/home/beep1560/.config/ibus/rime/pinyin_simp.userdb/LOG:2022/08/24-00:44:20.836703 140641316208448 Delete type=3 #4
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - 佚名
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - stroke
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:  - name: full_shape
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:  - name: ascii_punct
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - script_translator
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - reverse_lookup_translator
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - erase/^hm$/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - erase/^m$/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - erase/^n$/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - erase/^ng$/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - abbrev/^([a-z]).+$/$1/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - abbrev/^([zcs]h).+$/$1/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/^([nl])ue$/$1ve/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/^([jqxy])u/$1v/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/un$/uen/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/ui$/uei/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/iu$/iou/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/([aeiou])ng$/$1gn/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/([dtngkhrzcs])o(u|ng)$/$1o/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/ong$/on/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/ao$/oa/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - derive/([iu])a(o|ng?)$/a$1$2/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - xform/([nl])v/$1ü/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - xform/([nl])ue/$1üe/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - xform/([jqxy])v/$1u/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    - xlit/hspnz/一丨丿丶乙/
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    punct: "^/([0-9]+[a-z]*|[a-z]+)$"
/home/beep1560/.config/ibus/rime/pinyin_simp.schema.yaml:    reverse_lookup: "`[a-z]*'?$"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - simplifier
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - uniquifier
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "table_translator@custom_phrase"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - reverse_lookup_translator
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - script_translator
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+p", send: Up, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+n", send: Down, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+b", send: Left, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+f", send: Right, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+a", send: Home, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+e", send: End, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+d", send: Delete, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+k", send: "Shift+Delete", when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+h", send: BackSpace, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+g", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+bracketleft", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+y", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Alt+v", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+v", send: Page_Down, when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: ISO_Left_Tab, send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Shift+Tab", send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: Tab, send: "Shift+Right", when: composing}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: minus, send: Page_Up, when: has_menu}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: equal, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: comma, send: Page_Up, when: paging}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: period, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+1", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+2", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+3", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+4", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+5", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+exclam", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+at", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+numbersign", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+dollar", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - {accept: "Control+Shift+percent", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    "-": "－"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    "-": "-"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    email: "^[A-Za-z][-_.0-9A-Za-z]*@.*$"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    punct: "^/([0-9]0?|[A-Za-z]+)$"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    reverse_lookup: "`[a-z]*'?$"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    uppercase: "[A-Z][-_+.'0-9A-Za-z]*$"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    url: "^(www[.]|https?:|ftp[.:]|mailto:|file:).*$|^[a-z]+[.].+$"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "xform/([nl])v/$1ü/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "xlit/hspnz/一丨丿丶乙/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "佛振 <chen.sst@gmail.com>"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - stroke
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "derive/^([nl])ve$/$1ue/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "derive/^([jqxy])u/$1v/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "derive/un$/uen/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "derive/ui$/uei/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "derive/iu$/iou/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:  - name: full_shape
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:  - name: simplification
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:  - name: ascii_punct
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "xform/([nl])v/$1ü/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "xform/([nl])ue/$1üe/"
/home/beep1560/.config/ibus/rime/build/luna_quanpin.schema.yaml:    - "xform/([jqxy])v/$1u/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - script_translator
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - reverse_lookup_translator
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+p", send: Up, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+n", send: Down, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+b", send: Left, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+f", send: Right, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+a", send: Home, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+e", send: End, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+d", send: Delete, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+k", send: "Shift+Delete", when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+h", send: BackSpace, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+g", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+bracketleft", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+y", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Alt+v", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+v", send: Page_Down, when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: ISO_Left_Tab, send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Shift+Tab", send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: Tab, send: "Shift+Right", when: composing}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: minus, send: Page_Up, when: has_menu}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: equal, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: comma, send: Page_Up, when: paging}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: period, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+1", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+2", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+3", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+4", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+5", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+exclam", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+at", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+numbersign", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+dollar", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - {accept: "Control+Shift+percent", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    "-": "－"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    "-": "-"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    email: "^[A-Za-z][-_.0-9A-Za-z]*@.*$"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    punct: "^/([0-9]+[a-z]*|[a-z]+)$"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    reverse_lookup: "`[a-z]*'?$"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    uppercase: "[A-Z][-_+.'0-9A-Za-z]*$"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    url: "^(www[.]|https?:|ftp[.:]|mailto:|file:).*$|^[a-z]+[.].+$"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "xlit/hspnz/一丨丿丶乙/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "佚名"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - stroke
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "erase/^hm$/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "erase/^m$/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "erase/^n$/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "erase/^ng$/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "abbrev/^([a-z]).+$/$1/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "abbrev/^([zcs]h).+$/$1/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/^([nl])ue$/$1ve/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/^([jqxy])u/$1v/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/un$/uen/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/ui$/uei/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/iu$/iou/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/([aeiou])ng$/$1gn/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/([dtngkhrzcs])o(u|ng)$/$1o/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/ong$/on/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/ao$/oa/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "derive/([iu])a(o|ng?)$/a$1$2/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:  - name: full_shape
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:  - name: ascii_punct
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "xform/([nl])v/$1ü/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "xform/([nl])ue/$1üe/"
/home/beep1560/.config/ibus/rime/build/pinyin_simp.schema.yaml:    - "xform/([jqxy])v/$1u/"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - table_translator
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+p", send: Up, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+n", send: Down, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+b", send: Left, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+f", send: Right, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+a", send: Home, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+e", send: End, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+d", send: Delete, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+k", send: "Shift+Delete", when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+h", send: BackSpace, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+g", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+bracketleft", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+y", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Alt+v", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+v", send: Page_Down, when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: ISO_Left_Tab, send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Shift+Tab", send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: Tab, send: "Shift+Right", when: composing}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: minus, send: Page_Up, when: has_menu}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: equal, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: comma, send: Page_Up, when: paging}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: period, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+1", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+2", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+3", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+4", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+5", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+exclam", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+at", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+numbersign", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+dollar", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - {accept: "Control+Shift+percent", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    email: "^[A-Za-z][-_.0-9A-Za-z]*@.*$"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    uppercase: "[A-Z][-_+.'0-9A-Za-z]*$"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    url: "^(www[.]|https?:|ftp[.:]|mailto:|file:).*$|^[a-z]+[.].+$"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "Terry Tsang <archerindigo@gmail.com>"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w1$|標點符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w2$|括號符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w3$|一般符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w4$|數學符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w5$|方向符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w6$|單位符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w7$|圖表符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w8$|順序符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w9$|希臘符號|"
/home/beep1560/.config/ibus/rime/build/array30_wsymbols.schema.yaml:    - "xform|^w0$|注音符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^A$|🙂|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^S$|🧑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^D$|🐕|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^F$|🍴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^G$|✈|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^H$|⚽|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^J$|💡|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^K$|🔣|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|^L$|🏴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|v|4v|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|q|1↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|w|2↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|e|3↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|r|4↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|t|5↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|y|6↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|u|7↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|i|8↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|o|9↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|p|0↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|a|1‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|s|2‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|d|3‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|f|4‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|g|5‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|h|6‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|j|7‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|k|8‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|l|9‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|;|0‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|z|1↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|x|2↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|c|3↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|b|5↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|n|6↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|m|7↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|,|8↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|\\.|9↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|/|0↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - "xform|~| |"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^A$|🙂|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^S$|🧑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^D$|🐕|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^F$|🍴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^G$|✈|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^H$|⚽|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^J$|💡|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^K$|🔣|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^L$|🏴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|v|4v|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|q|1↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|w|2↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|e|3↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|r|4↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|t|5↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|y|6↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|u|7↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|i|8↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|o|9↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|p|0↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|a|1‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|s|2‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|d|3‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|f|4‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|g|5‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|h|6‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|j|7‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|k|8‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|l|9‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|;|0‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|z|1↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|x|2↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|c|3↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|b|5↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|n|6↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|m|7↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|,|8↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|\\.|9↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|/|0↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|~| |"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^A$|🙂|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^S$|🧑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^D$|🐕|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^F$|🍴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^G$|✈|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^H$|⚽|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^J$|💡|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^K$|🔣|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^L$|🏴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|v|4v|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|q|1↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|w|2↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|e|3↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|r|4↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|t|5↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|y|6↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|u|7↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|i|8↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|o|9↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|p|0↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|a|1‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|s|2‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|d|3‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|f|4‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|g|5‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|h|6‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|j|7‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|k|8‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|l|9‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|;|0‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|z|1↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|x|2↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|c|3↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|b|5↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|n|6↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|m|7↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|,|8↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|\\.|9↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|/|0↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|~| |"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - simplifier
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "simplifier@emoji_suggestion"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - uniquifier
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "reverse_lookup_filter@reverse_lookup_array30"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "affix_segmentor@wsymbols"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "affix_segmentor@array30_query"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "affix_segmentor@luna_pinyin"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - table_translator
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "table_translator@wsymbols"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "table_translator@array30_query"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "script_translator@luna_pinyin"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+p", send: Up, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+n", send: Down, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+b", send: Left, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+f", send: Right, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+a", send: Home, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+e", send: End, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+d", send: Delete, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+k", send: "Shift+Delete", when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+h", send: BackSpace, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+g", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+bracketleft", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+y", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Alt+v", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+v", send: Page_Down, when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: ISO_Left_Tab, send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Shift+Tab", send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: Tab, send: "Shift+Right", when: composing}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: minus, send: Page_Up, when: has_menu}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: equal, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: comma, send: Page_Up, when: paging}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: period, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+1", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+2", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+3", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+4", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+5", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+exclam", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+at", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+numbersign", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+dollar", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: "Control+Shift+percent", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: comma, send: comma, when: paging}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - {accept: period, send: period, when: has_menu}
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform/([nl])v/$1ü/"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform/([nl])ue/$1üe/"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform/([jqxy])v/$1u/"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    "-": "－"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    "-": "-"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    array30_query: "^.*[?]+[a-z;,./]*\\\\?$"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    email: "^[a-z][-_.0-9a-z]*@.*$"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    luna_pinyin: "`[a-z]*\\\\?$"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    wsymbols: "^[w][0-9]$"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^A$|🙂|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^S$|🧑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^D$|🐕|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^F$|🍴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^G$|✈|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^H$|⚽|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^J$|💡|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^K$|🔣|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^L$|🏴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|v|4v|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|q|1↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|w|2↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|e|3↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|r|4↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|t|5↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|y|6↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|u|7↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|i|8↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|o|9↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|p|0↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|a|1‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|s|2‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|d|3‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|f|4‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|g|5‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|h|6‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|j|7‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|k|8‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|l|9‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|;|0‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|z|1↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|x|2↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|c|3↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|b|5↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|n|6↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|m|7↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|,|8↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|\\.|9↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|/|0↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|~| |"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - luna_pinyin
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "發明人 廖明德先生"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "Jiehong Ma <ma.jiehong@gmail.com>"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "Terry Tsang <archerindigo@gmail.com>"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - array30_wsymbols
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - luna_quanpin
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform/^(.*)!$/$1/"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform/^(.*)@$/$1/"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - name: full_shape
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - name: simplification
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - name: extended_charset
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - name: ascii_punct
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:  - name: emoji_suggestion
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^A$|🙂|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^S$|🧑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^D$|🐕|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^F$|🍴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^G$|✈|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^H$|⚽|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^J$|💡|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^K$|🔣|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^L$|🏴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|v|4v|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|q|1↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|w|2↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|e|3↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|r|4↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|t|5↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|y|6↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|u|7↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|i|8↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|o|9↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|p|0↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|a|1‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|s|2‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|d|3‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|f|4‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|g|5‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|h|6‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|j|7‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|k|8‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|l|9‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|;|0‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|z|1↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|x|2↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|c|3↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|b|5↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|n|6↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|m|7↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|,|8↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|\\.|9↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|/|0↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|~| |"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "^[^ASDFGHJKL].?$"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^A$|🙂|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^S$|🧑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^D$|🐕|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^F$|🍴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^G$|✈|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^H$|⚽|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^J$|💡|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^K$|🔣|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^L$|🏴|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|v|4v|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|q|1↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|w|2↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|e|3↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|r|4↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|t|5↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|y|6↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|u|7↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|i|8↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|o|9↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|p|0↑|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|a|1‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|s|2‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|d|3‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|f|4‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|g|5‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|h|6‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|j|7‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|k|8‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|l|9‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|;|0‐|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|z|1↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|x|2↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|c|3↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|b|5↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|n|6↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|m|7↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|,|8↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|\\.|9↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|/|0↓|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|~| |"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w1$|標點符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w2$|括號符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w3$|一般符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w4$|數學符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w5$|方向符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w6$|單位符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w7$|圖表符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w8$|順序符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w9$|希臘符號|"
/home/beep1560/.config/ibus/rime/build/array30.schema.yaml:    - "xform|^w0$|注音符號|"
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+p", send: Up, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+n", send: Down, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+b", send: Left, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+f", send: Right, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+a", send: Home, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+e", send: End, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+d", send: Delete, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+k", send: "Shift+Delete", when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+h", send: BackSpace, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+g", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+bracketleft", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+y", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Alt+v", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+v", send: Page_Down, when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: ISO_Left_Tab, send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Shift+Tab", send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: Tab, send: "Shift+Right", when: composing}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: minus, send: Page_Up, when: has_menu}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: equal, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: comma, send: Page_Up, when: paging}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: period, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+1", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+2", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+3", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+4", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+5", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+exclam", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+at", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+numbersign", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+dollar", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    - {accept: "Control+Shift+percent", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/default.yaml:    "-": "－"
/home/beep1560/.config/ibus/rime/build/default.yaml:    "-": "-"
/home/beep1560/.config/ibus/rime/build/default.yaml:    email: "^[A-Za-z][-_.0-9A-Za-z]*@.*$"
/home/beep1560/.config/ibus/rime/build/default.yaml:    uppercase: "[A-Z][-_+.'0-9A-Za-z]*$"
/home/beep1560/.config/ibus/rime/build/default.yaml:    url: "^(www[.]|https?:|ftp[.:]|mailto:|file:).*$|^[a-z]+[.].+$"
/home/beep1560/.config/ibus/rime/build/default.yaml:  - schema: pinyin_simp
/home/beep1560/.config/ibus/rime/build/default.yaml:  - schema: array30
/home/beep1560/.config/ibus/rime/build/default.yaml:    - "Control+grave"
/home/beep1560/.config/ibus/rime/build/default.yaml:    - "Control+Shift+grave"
/home/beep1560/.config/ibus/rime/build/default.yaml:    - F4
/home/beep1560/.config/ibus/rime/build/default.yaml:    - full_shape
/home/beep1560/.config/ibus/rime/build/default.yaml:    - ascii_punct
/home/beep1560/.config/ibus/rime/build/default.yaml:    - simplification
/home/beep1560/.config/ibus/rime/build/default.yaml:    - extended_charset
/home/beep1560/.config/ibus/rime/build/default.yaml:    - zh_hant
/home/beep1560/.config/ibus/rime/build/default.yaml:    - zh_hans
/home/beep1560/.config/ibus/rime/build/default.yaml:    - zh_hant_tw
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - reverse_lookup
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - reverse_lookup_translator
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - table_translator
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+p", send: Up, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+n", send: Down, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+b", send: Left, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+f", send: Right, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+a", send: Home, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+e", send: End, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+d", send: Delete, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+k", send: "Shift+Delete", when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+h", send: BackSpace, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+g", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+bracketleft", send: Escape, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+y", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Alt+v", send: Page_Up, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+v", send: Page_Down, when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: ISO_Left_Tab, send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Shift+Tab", send: "Shift+Left", when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: Tab, send: "Shift+Right", when: composing}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: minus, send: Page_Up, when: has_menu}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: equal, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: comma, send: Page_Up, when: paging}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: period, send: Page_Down, when: has_menu}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+1", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+2", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+3", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+4", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+5", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+exclam", select: .next, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+at", toggle: ascii_mode, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+numbersign", toggle: full_shape, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+dollar", toggle: simplification, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - {accept: "Control+Shift+percent", toggle: extended_charset, when: always}
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    "-": "－"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    "-": "-"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    email: "^[A-Za-z][-_.0-9A-Za-z]*@.*$"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    reverse_lookup: "`[a-z]*'?$"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    uppercase: "[A-Z][-_+.'0-9A-Za-z]*$"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    url: "^(www[.]|https?:|ftp[.:]|mailto:|file:).*$|^[a-z]+[.].+$"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "xlit/hspnz/一丨丿丶乙/"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "xform/([nl])v/$1ü/"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "xform/([nl])ue/$1üe/"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "xform/([jqxy])v/$1u/"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "四季的風"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "雪齋"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "Kunki Chou"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - luna_pinyin
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:  - name: full_shape
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:  - name: ascii_punct
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "xform/~//"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "xlit/hspnz/一丨丿丶乙/"
/home/beep1560/.config/ibus/rime/build/stroke.schema.yaml:    - "xlit/hspnz/一丨丿丶乙/"
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - Terry Tsang <archerindigo@gmail.com>
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - table_translator
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w1$|標點符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w2$|括號符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w3$|一般符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w4$|數學符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w5$|方向符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w6$|單位符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w7$|圖表符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w8$|順序符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w9$|希臘符號|'
/home/beep1560/.config/ibus/rime/array30_wsymbols.schema.yaml:    - 'xform|^w0$|注音符號|'
/home/beep1560/.config/ibus/rime/array30_query.dict.yaml:---
/home/beep1560/.config/ibus/rime/array30_query.dict.yaml:  - array30_main
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - Terry Tsang <archerindigo@gmail.com>
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:  - name: full_shape
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:  - name: simplification
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:  - name: extended_charset
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:  - name: ascii_punct
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - table_translator
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - xform/^(.*)!$/$1/                 # 簡碼
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - xform/^(.*)@$/$1/                 # 特別碼（須置於簡碼之後）
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.).$/$1\?/               # .?
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^.(.)$/\?$1/               # ?.
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.)(.).$/$1$2\?/          # ..?
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.).(.)$/$1\?$2/          # .?.
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.)..$/$1\?\?/            # .??
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^.(.)(.)$/\?$1$2/          # ?..
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^.(.).$/\?$1\?/            # ?.?
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^..(.)$/\?\?$1/            # ??.
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.)(.)(.).$/$1$2$3\?/     # ...?
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.)(.).(.)$/$1$2\?$3/     # ..?.
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.)(.)..$/$1$2\?\?/       # ..??
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.).(.)(.)$/$1\?$2$3/     # .?..
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.).(.).$/$1\?$2\?/       # .?.?
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.)..(.)$/$1\?\?$2/       # .??.
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^(.)...$/$1\?\?\?/         # .???
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^.(.)(.)(.)$/\?$1$2$3/     # ?...
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^.(.)(.).$/\?$1$2\?/       # ?..?
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^.(.).(.)$/\?$1\?$2/       # ?.?.
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^.(.)..$/\?$1\?\?/         # ?.??
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^..(.)(.)$/\?\?$1$2/       # ??..
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^..(.).$/\?\?$1\?/         # ??.?
/home/beep1560/.config/ibus/rime/array30_query.schema.yaml:    - derive/^...(.)$/\?\?\?$1/         # ???.
/home/beep1560/.config/ibus/rime/array30.schema.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 發明人 廖明德先生
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - Jiehong Ma <ma.jiehong@gmail.com>
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - Terry Tsang <archerindigo@gmail.com>
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - array30_wsymbols
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - luna_quanpin
/home/beep1560/.config/ibus/rime/array30.schema.yaml:  - name: ascii_mode
/home/beep1560/.config/ibus/rime/array30.schema.yaml:  - name: full_shape
/home/beep1560/.config/ibus/rime/array30.schema.yaml:  - name: simplification
/home/beep1560/.config/ibus/rime/array30.schema.yaml:  - name: extended_charset
/home/beep1560/.config/ibus/rime/array30.schema.yaml:  - name: ascii_punct
/home/beep1560/.config/ibus/rime/array30.schema.yaml:  - name: emoji_suggestion
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - ascii_composer
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - recognizer
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - key_binder
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - speller
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - punctuator
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - selector
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - navigator
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - express_editor
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - ascii_segmentor
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - matcher
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - abc_segmentor
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - affix_segmentor@wsymbols
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - affix_segmentor@array30_query                 # "?"萬用字元用
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - affix_segmentor@luna_pinyin                   # 反查拼音用
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - punct_segmentor
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - fallback_segmentor
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - table_translator
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - table_translator@wsymbols
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - table_translator@array30_query                # "?"萬用字元用
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - punct_translator
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - script_translator@luna_pinyin                 # 反查拼音用
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - simplifier
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - simplifier@emoji_suggestion
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - uniquifier
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - reverse_lookup_filter@reverse_lookup_array30      # 反查
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^A$|🙂|'   # Smileys & Emotion
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^S$|🧑|'   # People & Body
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^D$|🐕|'   # Animals & Nature
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^F$|🍴|'   # Food & Drink
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^G$|✈|'   # Travel & Places
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^H$|⚽|'   # Activities
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^J$|💡|'   # Objects
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^K$|🔣|'   # Symbols
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^L$|🏴|'   # Flags
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|v|4v|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|q|1↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|w|2↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|e|3↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|r|4↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|t|5↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|y|6↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|u|7↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|i|8↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|o|9↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|p|0↑|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|a|1‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|s|2‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|d|3‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|f|4‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|g|5‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|h|6‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|j|7‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|k|8‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|l|9‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|;|0‐|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|z|1↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|x|2↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|c|3↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|b|5↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|n|6↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|m|7↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|,|8↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|\.|9↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|/|0↓|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|~| |'      # 消除逐鍵提示前綴'~'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - xform/^(.*)!$/$1/                 # 簡碼
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - xform/^(.*)@$/$1/                 # 特別碼（須置於簡碼之後）
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - "^[^ASDFGHJKL].?$"  # 單碼及雙碼不調頻，以保持簡碼位置。Emoji例外
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w1$|標點符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w2$|括號符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w3$|一般符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w4$|數學符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w5$|方向符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w6$|單位符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w7$|圖表符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w8$|順序符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w9$|希臘符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - 'xform|^w0$|注音符號|'
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - xform/([nl])v/$1ü/
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - xform/([nl])ue/$1üe/
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - xform/([jqxy])v/$1u/
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - { when: paging, accept: comma, send: comma }
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    - { when: has_menu, accept: period, send: period }
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    wsymbols: "^[w][0-9]$"
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    array30_query: "^.*[?]+[a-z;,.\/]*\\\\?$"
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    luna_pinyin: "`[a-z]*\\\\?$"
/home/beep1560/.config/ibus/rime/array30.schema.yaml:    email: "^[a-z][-_.0-9a-z]*@.*$"
/home/beep1560/.config/ibus/rime/installation.yaml:distribution_code_name: "ibus-rime"
/home/beep1560/.config/ibus/rime/installation.yaml:installation_id: "4eb4d252-3191-405b-a877-bc44d4a12ab3"
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/CURRENT:MANIFEST-000190
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG.old:2022/08/24-00:45:25.896847 140641316208448 Recovering log #186
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG.old:2022/08/24-00:45:25.896873 140641316208448 Level-0 table #188: started
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG.old:2022/08/24-00:45:25.896885 140641316208448 Level-0 table #188: 0 bytes OK
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG.old:2022/08/24-00:45:25.997478 140641316208448 Delete type=3 #184
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG.old:2022/08/24-00:45:25.997507 140641316208448 Delete type=0 #186
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG:2022/08/24-00:45:51.093528 140641316208448 Recovering log #189
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG:2022/08/24-00:45:51.093550 140641316208448 Level-0 table #191: started
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG:2022/08/24-00:45:51.093562 140641316208448 Level-0 table #191: 0 bytes OK
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG:2022/08/24-00:45:51.193587 140641316208448 Delete type=3 #187
/home/beep1560/.config/ibus/rime/luna_pinyin.userdb/LOG:2022/08/24-00:45:51.193611 140641316208448 Delete type=0 #189
/home/beep1560/.config/ibus/rime/array30_phrases.dict.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30_phrases.dict.yaml:#   - 新行列30輸入法詞庫（共178,399詞）
/home/beep1560/.config/ibus/rime/array30_phrases.dict.yaml:#     - https://www.ptt.cc/bbs/Array/M.1627556992.A.8D4.html
/home/beep1560/.config/ibus/rime/array30_phrases.dict.yaml:#   - Terry Tsang <archerindigo@gmail.com>
/home/beep1560/.config/ibus/rime/array30_phrases.dict.yaml:---
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# encoding: utf-8
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# - 中日韓統一表意文字擴充區A至G
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# - 一、二級簡碼
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# - 特別碼
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# - 行列輸入法原生標點符號碼
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# - 簡碼順序列出，不預佔特定數字鍵位置
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:---
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# Begin of 1-key and 2-key characters
/home/beep1560/.config/ibus/rime/array30_main.dict.yaml:# End of 1-key and 2-key characters
#+end_example

**** alternatives

***** a



***** b



***** c



***** d



**** answer



*** 2

**** transcript

过桥时，如果对脚下湍急的河水过多地注视，则会觉得桥逆水流而动，河水却不动，这就是运动错觉。产生这种运动错觉的原因是人们把流动的河水参照系当成了静止的参照系。

**** alternatives

***** a



***** b



***** c



***** d



**** answer



*** 3

**** transcript

一个处于积极状态的人可以拥有好成绩、高分数、好的经济地位和社会地位，但积极状态并不是指这些外在的指标，这些只是一个人奋斗和机遇的结果。积极状态指一个人具有的出色的综合心理素质、积极的人生态度。

**** alternatives

***** a



***** b



***** c



***** d



**** answer



*** 4

**** transcript

大工业时代延续至今的“快文化”，使全世界40％的人患上“时间疾病”。他们整日为工作忙碌，精神焦虑，忘记了自己的兴趣和爱好。因此丢掉快节奏，号召人们让自己的生活节奏慢下来，让生活更加人性化才是正道。

**** alternatives

***** a



***** b



***** c



***** d



**** answer



*** 5

**** transcript

过去，西藏可可西里偷捕藏羚羊的现象十分严重，偷猎分子洋枪快车，甚为嚣张。由于这些年加大了打击力度，捕杀藏羚羊的事件不断减少。这说明只要重视，野生动物一定可以得到更大限度的保护。

***** translation
:PROPERTIES:
:CREATED: [2022-08-22 10:00:04 -05]
:END:

In the past, the phenomenon of poaching Tibetan antelope in Tibet's Cocosi is very production heavy, poaching molecules foreign guns fast car, very arrogant. Because of these years can not increase the fight and degree In the past, the poaching of Tibetan antelope has been decreasing. This shows that as long as attention is paid, wildlife can certainly get more limited protection.

**** alternatives

***** a



***** b



***** c



***** d



**** answer

**  第二部分

*** 对话

男：您是一位从事野外生态研究的科学家，今天现场的观众都渴望和您聊聊大熊猫。
女：大家都知道，大熊猫是国家一级保护动物，是中国的国宝。
男：世界上动物那么多，为什么大熊猫得到了这么特殊的待遇呢？就是因为它长得憨态可掬吗？
女：不是，主要是因为它稀少，已经濒临灭绝，换句话说，大熊猫这个物种正面临着从地球上消失的危险。
男：真是挺严峻的！大熊猫濒临灭绝和我们人类的活动有关吗？
女：关系很大。比如，人类不断扩大自己的生存空间，使大熊猫栖息地面积缩减；再比如，由于生态环境的破坏，使熊猫唯一的食物来源——竹林减少，这些都会直接威胁到熊猫的生存。
男：那大熊猫濒临灭绝有它自身的原因吗？
女：当然也有。
男：您不妨先说说，在大自然里，什么样的动物才能生存下去吧。
女：一般说来动物要生存下去，至少要具备以下七点中的某几点：一、有强健的肌肉，有锐利的爪子或锋利的牙齿；二、有快速奔跑的能力；三、有挖洞穴居的习性；四、有爬树的本事，或者能在树上生存，躲避敌害，储藏食物；五、有很强的繁殖能力；六、有很杂的食性；七、有很好的消化吸收能力。
男：大熊猫呢？
女：可以说，以上七点中，大熊猫哪一点都不具备。大熊猫的祖先是凶猛的食肉动物，可今天的大熊猫既没有利爪，也没有利牙，整天一副懒洋洋、温顺可人的样子；虽然它还保留着爬树的本领，可是那速度，也就是饭后遛食了；至于食谱，它只以新鲜的竹叶做主食，在它每天都吃掉的竹叶里，也只能消化掉一小部分，大多数营养都白白地浪费了；还有，它的繁殖能力也很差。这就是大熊猫濒临灭绝的内在因素。
男：是啊，这一切足以证实，大熊猫的保护工作确实是迫在眉睫。

*** 题目

**** 6

***** 问题

大熊猫为什么成为国家一级保护动物？

**** 7

***** 问题

人类怎样威胁到了大熊猫的生存？

**** 8

***** 问题

有利于动物生存的内在因素不包括什么？

**** 9

***** 问题

大熊猫濒临灭绝的内在因素有什么？

**** 10

***** 问题

这段话主要谈的是什么？

